Annotator/app/controllers/annotations_controller.rb

    def create
        @annotation = current_user.annotations.build(params[:annotation])
        if @annotation.save
---
INSERT INTO "annotations" ("created_at", "email", "tweetId", "updated_at", "user_id", "value") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Mon, 22 Jul 2013 22:00:36 UTC +00:00], ["email", nil], ["tweetId", "159"], ["updated_at", Mon, 22 Jul 2013 22:00:36 UTC +00:00], ["user_id", 1], ["value", "sarcastic"]]