Annotator/app/controllers/static_pages_controller.rb

  def home
    if signed_in?
      #@tweet = current_user.tweets.build
      @feed_item = current_user.feed
      @annotation = current_user.annotations.build
      @count = current_user.counter
---
SELECT COUNT(*) FROM "annotations" WHERE "annotations"."user_id" IN (1)