Annotator/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    #if @user.username != params[:id]
      #redirect_to user_path(@user)
   # else
    @user = User.find(params[:id])

INSERT INTO "users" ("admin", "created_at", "email", "language_level", "name", "number_of_annotations", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if @user.save